var tab_config = {
    options_packet: [],
    options_channel: [],
    options_pms_roles: [["all_special_character", "-请选择-"]],
    options_pms_tree: [],
    options_prize_ids: [["all_special_character", "-请选择-"]],
    options_mail_prize_ids: [],

    options_item_ids: [["all_special_character", "-请选择-"],[101002, "3天VIP表情卡"],[101003, "7天VIP表情卡"],
    [101004, "30天VIP表情卡"],[104002, "3天魔法表情卡"],[104003, "7天魔法表情卡"],[104004, "30天魔法表情卡"],[201001, "经验1.5倍卡"],
    [201002, "经验双倍卡"],[404001, "SNG1入场券"],[404002, "SNG2入场券"],[404003, "SNG3入场券"],[404004, "SNG4入场券"],
    [404005, "SNG5入场券"],[404006, "SNG6入场券"],[405001, "10000筹码"],[405002, "50000筹码"],[406001, "3个喇叭"],
    [406002, "10个喇叭"],[501001, "等级礼包1"],[501002, "等级礼包2"],[501003, "等级礼包3"],[501004, "等级礼包4"],
    [501005, "等级礼包5"],[501006, "等级礼包6"],[501007, "等级礼包7"]],

    options_prize_ids_item:[["all_special_character", "-请选择-"],[100102001, "等级礼包1奖励"],[100102002, "等级礼包2奖励"],
    [100102003, "等级礼包3奖励"],[100102004, "等级礼包4奖励"],[100102005, "等级礼包5奖励"],[100102006, "等级礼包6奖励"],[100102007, "等级礼包7奖励"],
    [101501006, "大转盘1.5倍经验卡"],[101501007, "大转盘SNG门票"],[101501008, "大转盘VIP表情卡"],[101501009, "大转盘魔法表情卡"],
    [-101002001, "SNG1入场扣除入场券"],[-101002002, "SNG2入场扣除入场券"],[-101002003, "SNG3入场扣除入场券"],[-101002004, "SNG4入场扣除入场券"],
    [-101002005, "SNG5入场扣除入场券"],[-101002006, "SNG6入场扣除入场券"],[100808001,"10000筹码"],[100808002,"50000筹码"],[100808003,"3天VIP表情卡"],
    [100808004,"7天VIP表情卡"],[100808005,"30天VIP表情卡"],[100808006,"3天魔法表情卡"],[100808007,"7天魔法表情卡"],[100808008,"30天魔法表情卡"],
    [100808009,"3个喇叭"],[100808010,"10个喇叭"],[100808011,"经验50%卡"],[100808012,"经验翻倍卡"],[100808013,"柏林SNG门票"],[100808014,"罗马SNG门票"],
    [100808015,"伦敦SNG门票"],[100808016,"米兰SNG门票"],[100808017,"巴黎SNG门票"],[100808018,"澳门SNG门票"],[100809001,"等级礼包1"],
    [100810001,"累计充值礼包"],[100810002,"累计充值礼包"],[100810003,"累计充值礼包"],[100810004,"累计充值礼包"],[100810005,"累计充值礼包"],
    [100810006,"累计充值礼包"]],
    set_pms: function (tab, pms_op) {
        var obj;
        if (config.path == "index.html") {
            obj = tab_index[tab];
        } else if (config.path == "game.html") {
            obj = tab_game[tab];
        } else if (config.path == "account.html") {
            obj = tab_account[tab];
        } else if (config.path == "gm.html") {
            obj = tab_gm[tab];
        } else if (config.path == "data.html") {
            obj = tab_data[tab];
        }
        if (obj != undefined) {
            obj.all_pms = pms_op;
        }
    }

};
